==============================
boolean literals
==============================

true
false

---

(source_file
  (boolean_literal)
  (boolean_literal))


==============================
natural number literals
==============================

0
9
18446744073709551615

---

(source_file
  (natural_literal)
  (natural_literal)
  (natural_literal))

==============================
integer number literals
==============================

+4
-9223372036854775808
+9223372036854775807

---

(source_file
  (integer_literal)
  (integer_literal)
  (integer_literal))


==============================
float number literals
==============================

1.6777216
-1235.62

---

(source_file
  (float_literal)
  (float_literal))


==============================
text literal
==============================

"text"
"""
hello world
you
"""
"""
hello escaped \" world
"""

---

(source_file
  (text_literal)
  (text_literal)
  (text_literal))


==============================
character literal
==============================

?a
?ã²
?ğŸ”¥
?\t

---

(source_file
  (char_literal)
  (char_literal)
  (char_literal)
  (char_literal))


==============================
byte literal
==============================

0xsdeadbeef

---

(source_file
  (byte_literal))


==============================
hash literal
==============================

#r1mtr0
#2ef7bde608ce5404e97d5f042f95f89f1c2328715cc02967cd3bef656b753ecb6bce67141dfb7b9f

---

(source_file
  (hash_literal)
  (hash_literal))


==============================
list literal
==============================

[]
["x"]
[1,2, 3]
[,,2]

---

(source_file
  (list_literal)
  (list_literal
    (text_literal))
  (list_literal
    (natural_literal)
    (natural_literal)
    (natural_literal))
  (list_literal
    (natural_literal)))


==============================
function literal/lambda
==============================

x -> x Nat.+ 2

---

(source_file
  (hash_literal)
  (hash_literal))


==============================
tuple literal
==============================

()
("x")
(1,2, 3)
(,2,"hello")

---

(source_file
  (tuple_literal)
  (tuple_literal
    (text_literal))
  (tuple_literal
    (natural_literal)
    (natural_literal)
    (natural_literal)))
  (tuple_literal
    (natural_literal)
    (text_literal)))
